ch32-riscv-ug/CH32V20x/EVT_205/EXAM/QSPI/QSPI_FLASH_DMA/User/main.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : main.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2025/05/20
 * Description        : Main program body.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for 
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/

/*
 *@Note
 *QSPI routine:
 *This example demonstrates QSPI operation Winbond W25Qxx SPIFLASH.
 *
 *   hardware connection:	
 *   PA12 -- QSPI_SCK
 *     PB0  -- QSPI_SCSN
 *    PA2  -- QSPI_SIO0
 *    PA3  -- QSPI_SIO1
 *    PA0  -- QSPI_SIO2
 *   PA1  -- QSPI_SIO3
 *
 */

#include "debug.h"
#include "string.h"
#include "ch32v205_qspi.h"

#define FLASH_CMD_EnableReset             0x66
#define FLASH_CMD_ResetDevice             0x99
#define FLASH_CMD_JedecID                 0x9F
#define FLASH_CMD_WriteEnable             0X06
#define FLASH_CMD_WriteDisable            0X04
#define FLASH_CMD_ManufactDeviceID        0x90
#define FLASH_CMD_ManufactDeviceID_DualIO 0x92
#define FLASH_CMD_ManufactDeviceID_QuadIO 0x94
#define FLASH_CMD_SectorErase             0x20
#define FLASH_CMD_Read                    0x03
#define FLASH_CMD_FastRead                0x0B
#define FLASH_CMD_FastReadQuadIO          0xEB
#define FLASH_CMD_FastReadDualIO          0xBB
#define FLASH_CMD_PageProgram             0x02
#define FLASH_CMD_PageProgramQuad         0x32
#define FLASH_CMD_ReadStatus_REG1         0X05
#define FLASH_CMD_ReadStatus_REG2         0X35

#define FLASH_SECTOR_SIZE                 (4096U)
#define FLASH_PAGE_SIZE                   (256U)

uint8_t readBuffer[512];
uint8_t verifyBuffer[512];
uint8_t writeBuffer[256];

/*********************************************************************
 * @fn      QSPI_Send
 * 
 * @brief   Send data to QSPI
 * 
 * @param   pBuffer - pointer to the data buffer
 * @param   len - length of the data to be send
 * 
 * @return  none
 */
void QSPI_Send(uint8_t* pBuffer, uint32_t len)
{
    uint32_t i = 0;
    while (i < len)
    {
        if (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_FT))
        {
            QSPI_SendData8(QSPI1, pBuffer[i]);
            i++;
        }
    }
}

/*********************************************************************
 * @fn      QSPI_Receive
 * 
 * @brief   Receive data from QSPI
 * 
 * @param   pBuffer - pointer to the data buffer
 * @param   len - length of the data to be received
 * 
 * @return  none
 */
void QSPI_Receive(uint8_t* pBuffer, uint32_t len)
{
    uint32_t i = 0;
    while (i < len)
    {
        if (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_FT))
        {
            pBuffer[i] = QSPI_ReceiveData8(QSPI1);
            i++;
        }
    }
}

/*********************************************************************
 * @fn      GPIO_Config
 * 
 * @brief   Configure the GPIO pins
 * 
 * @param   none
 */
static void GPIO_Config(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_AFIO, ENABLE);
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOA, ENABLE);
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOB, ENABLE);

    // QSPI_SCK PA12(AF5)
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource12, GPIO_AF5);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_12;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // QSPI_SCSN PB0(AF5)
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF5);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // QSPI_SIO0 PA2(AF5)
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF5);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // QSPI_SIO1 PA3(AF5)
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF5);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // QSPI_SIO2 PA0(AF5)
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF5);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // QSPI_SIO3 PA1(AF5)
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF5);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
}

/*********************************************************************
 * @fn      QSPI1_Config
 * 
 * @brief   Configure the QSPI1
 * 
 * @param   none
 */
static void QSPI1_Config(void)
{
    QSPI_InitTypeDef QSPI_InitStructure = {0};

    RCC_HBPeriphClockCmd(RCC_HBPeriph_QSPI1, ENABLE);
    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA2, ENABLE);

    QSPI_InitStructure.QSPI_Prescaler = 8;
    QSPI_InitStructure.QSPI_CKMode    = QSPI_CKMode_Mode3;
    QSPI_InitStructure.QSPI_CSHTime   = QSPI_CSHTime_7Cycle;

    // size = 2 ** (FSize + 1) = 2 ** 23 = 8MB
    QSPI_InitStructure.QSPI_FSize = 22;

    QSPI_InitStructure.QSPI_FSelect = QSPI_FSelect_1;
    QSPI_InitStructure.QSPI_DFlash  = QSPI_DFlash_Disable;

    QSPI_Init(QSPI1, &QSPI_InitStructure);
    QSPI_SetFIFOThreshold(QSPI1, 5);
    QSPI_SetDataLength(QSPI1, 1);
}

