ch32-riscv-ug/CH32V20x/EVT_205/EXAM/QSPI/QSPI_FLASH_DMA/User/main.c
void QSPI_Rx_DMA(uint8_t* buffer, uint32_t len)
{
    DMA_InitTypeDef DMA_InitStructure = {0};

    DMA_DeInit(DMA2_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (u32) & (QSPI1->DR);
    DMA_InitStructure.DMA_Memory0BaseAddr    = (u32)buffer;
    DMA_InitStructure.DMA_DIR                = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize         = len / 4;
    DMA_InitStructure.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc          = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
    DMA_InitStructure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Word;
    DMA_InitStructure.DMA_Mode               = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority           = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M                = DMA_M2M_Disable;
    DMA_Init(DMA2_Channel1, &DMA_InitStructure);

    DMA_ClearFlag(DMA2, DMA_FLAG_TC1);
}

void QSPI_Tx_DMA(uint8_t* buffer, uint32_t len)
{
    DMA_InitTypeDef DMA_InitStructure = {0};

    DMA_DeInit(DMA2_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (u32) & (QSPI1->DR);
    DMA_InitStructure.DMA_Memory0BaseAddr    = (u32)buffer;
    DMA_InitStructure.DMA_DIR                = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize         = len / 4;
    DMA_InitStructure.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc          = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
    DMA_InitStructure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Word;
    DMA_InitStructure.DMA_Mode               = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority           = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M                = DMA_M2M_Disable;
    DMA_Init(DMA2_Channel1, &DMA_InitStructure);

    DMA_ClearFlag(DMA2, DMA_FLAG_TC1);
}

/*********************************************************************
 * @fn      QSPI_CmdWithAddress
 * 
 * @brief   Send a command with an address to the QSPI
 * 
 * @param   cmd - the command to be sent
 *          addr - the address to be sent
 * 
 * @return  none
 */
void QSPI_CmdWithAddress(uint8_t cmd, uint32_t addr)
{
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_NoData;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = cmd;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 0;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetAddress(QSPI1, addr);

    QSPI_Start(QSPI1);

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }

    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
}

/*********************************************************************
 * @fn      QSPI_WriteCmd
 * 
 * @brief   Write a command to the QSPI
 * 
 * @param   cmd - the command to be written
 * 
 * @return  none
 */
void QSPI_WriteCmd(uint8_t cmd)
{
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_NoAddress;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_NoData;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = cmd;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 0;

    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_Start(QSPI1);

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }

    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
}

/*********************************************************************
 * @fn      QSPI_CmdWithData
 * 
 * @brief   Send a command with data to the QSPI
 * 
 * @param   cmd - the command to be sent
 *          data - the data to be sent
 * 
 * @return  none
 */
void QSPI_CmdWithData(uint8_t cmd, uint8_t data)
{
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_NoAddress;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Write;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = cmd;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 0;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetDataLength(QSPI1, 1);

    QSPI_Start(QSPI1);

