ch32-riscv-ug/CH32V20x/EVT_205/EXAM/QSPI/QSPI_FLASH_DMA/User/main.c
    QSPI_SetAddress(QSPI1, addr);
    QSPI_SetDataLength(QSPI1, len);

    QSPI_DMACmd(QSPI1, ENABLE);
    QSPI_Tx_DMA(data, len);
    DMA_Cmd(DMA2_Channel1, ENABLE);

    QSPI_Start(QSPI1);

    while (DMA_GetFlagStatus(DMA2, DMA_FLAG_TC1) == RESET)
    {
    }

    QSPI_DMACmd(QSPI1, DISABLE);

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
}

/*********************************************************************
 * @fn      QSPI_WritePageQuad
 * 
 * @brief   Write a page of the QSPI in 4 lines mode
 * 
 * @param   addr - the address of the page to be written
 *          data - the data to be written
 *          len - the length of the data to be written
 * 
 * @return  none
 */
void QSPI_WritePageQuad(uint32_t addr, uint8_t* data, uint16_t len)
{

    QSPI_AbortRequest(QSPI1);

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }
    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_4Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Write;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_PageProgramQuad;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 0;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetAddress(QSPI1, addr);
    QSPI_SetDataLength(QSPI1, len);

    QSPI_EnableQuad(QSPI1, ENABLE);

    QSPI_DMACmd(QSPI1, ENABLE);
    QSPI_Tx_DMA(data, len);
    DMA_Cmd(DMA2_Channel1, ENABLE);

    QSPI_Start(QSPI1);

    while (DMA_GetFlagStatus(DMA2, DMA_FLAG_TC1) == RESET)
    {
    }

    QSPI_DMACmd(QSPI1, DISABLE);

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_EnableQuad(QSPI1, DISABLE);
}

/*********************************************************************
 * @fn      QSPI_ProgramPage
 * 
 * @brief   Program a page of the QSPI
 * 
 * @param   addr - the address of the page to be programmed
 *          data - the data to be programmed
 *          len - the length of the data to be programmed
 * 
 * @return  none
 */
void QSPI_ProgramPage(uint32_t addr, uint8_t* data, uint16_t len)
{
    QSPI_WriteEnable();
    QSPI_WritePage(addr, data, len);
    QSPI_WaitForBsy();
}

/*********************************************************************
 * @fn      QSPI_ProgramPageQuad
 * 
 * @brief   Program a page of the QSPI in 4 lines mode
 * 
 * @param   addr - the address of the page to be programmed
 *          data - the data to be programmed
 *          len - the length of the data to be programmed
 * 
 * @return  none
 */
void QSPI_ProgramPageQuad(uint32_t addr, uint8_t* data, uint16_t len)
{
    QSPI_WriteEnable();
    QSPI_WritePageQuad(addr, data, len);
    QSPI_WaitForBsy();
}

/*********************************************************************
 * @fn      QSPI_GetManufacturerID
 * 
 * @brief   Read the manufacturer and device ID of the QSPI
 * 
 * @param   none
 * 
 * @return  the manufacturer and device ID of the QSPI
 */
uint32_t QSPI_GetManufacturerID()
{
    uint32_t res = 0;
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_ManufactDeviceID;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 0;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetAddress(QSPI1, 0);
    QSPI_SetDataLength(QSPI1, 2);

    QSPI_Start(QSPI1);

    uint32_t i = 0;

    while (i < 2)
    {
        if (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_FT))
        {
            res <<= 8;
            res |= QSPI_ReceiveData8(QSPI1);
            i++;
        }
    }

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    return res;
}

/*********************************************************************
 * @fn      QSPI_GetManufacturerID_DualIO
 * 
 * @brief   Read the manufacturer and device ID of the QSPI in 2 lines mode
 * 
 * @param   none
 * 
 * @return  the manufacturer and device ID of the QSPI
 */
uint32_t QSPI_GetManufacturerID_DualIO()
{
    uint32_t res = 0;
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_2Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_2Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_ManufactDeviceID_DualIO;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 4;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetDataLength(QSPI1, 2);
    QSPI_EnableQuad(QSPI1, ENABLE);
    QSPI_Start(QSPI1);

