ch32-riscv-ug/CH32V20x/EVT_205/EXAM/QSPI/QSPI_FLASH_DMA/User/main.c
    uint32_t i = 0;
    while (i < 2)
    {
        if (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_FT))
        {
            res <<= 8;
            res |= QSPI_ReceiveData8(QSPI1);
            i++;
        }
    }

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_EnableQuad(QSPI1, DISABLE);
    return res;
}

/*********************************************************************
 * @fn      QSPI_GetManufacturerID_QuadIO
 * 
 * @brief   Read the manufacturer and device ID of the QSPI in 4 lines mode
 * 
 * @param   none
 * 
 * @return  the manufacturer and device ID of the QSPI
 */
uint32_t QSPI_GetManufacturerID_QuadIO()
{
    uint32_t res = 0;
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_4Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_4Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_ManufactDeviceID_QuadIO;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 6;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetDataLength(QSPI1, 2);
    QSPI_EnableQuad(QSPI1, ENABLE);
    QSPI_Start(QSPI1);

    uint32_t i = 0;
    while (i < 2)
    {
        if (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_FT))
        {
            res <<= 8;
            res |= QSPI_ReceiveData8(QSPI1);
            i++;
        }
    }

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_EnableQuad(QSPI1, DISABLE);
    return res;
}

/*********************************************************************
 * @fn      QSPI_GetData
 * 
 * @brief   Read data from the QSPI
 * 
 * @param   addr - the address of the data to be read
 *          data - the buffer to store the data
 *          len - the length of the data to be read
 * 
 * @return  none
 */
void QSPI_GetData(uint32_t addr, uint8_t* data, uint32_t len)
{
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_FastRead;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 8;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetAddress(QSPI1, addr);
    QSPI_SetDataLength(QSPI1, len);

    QSPI_Rx_DMA(data, len);
    QSPI_DMACmd(QSPI1, ENABLE);
    QSPI_Start(QSPI1);
    DMA_Cmd(DMA2_Channel1, ENABLE);

    while (DMA_GetFlagStatus(DMA2, DMA_FLAG_TC1) == RESET)
    {
    }

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_DMACmd(QSPI1, DISABLE);
}

void QSPI_GetData_DualIO(uint32_t addr, uint8_t* data, uint32_t len)
{
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_2Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_2Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_FastReadDualIO;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 4;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

    QSPI_SetAddress(QSPI1, addr);
    QSPI_SetDataLength(QSPI1, len);

    QSPI_Rx_DMA(data, len);
    QSPI_DMACmd(QSPI1, ENABLE);
    QSPI_Start(QSPI1);
    DMA_Cmd(DMA2_Channel1, ENABLE);

    while (DMA_GetFlagStatus(DMA2, DMA_FLAG_TC1) == RESET)
    {
    }

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_DMACmd(QSPI1, DISABLE);
}

/*********************************************************************
 * @fn      QSPI_GetData_QuadIO
 * 
 * @brief   Read data from the QSPI in 4 lines mode
 * 
 * @param   addr - the address of the data to be read
 *          data - the buffer to store the data
 *          len - the length of the data to be read
 * 
 * @return  none    
 */
void QSPI_GetData_QuadIO(uint32_t addr, uint8_t* data, uint32_t len)
{
    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_IDLE) == RESET)
    {
    }

    QSPI_ComConfig_InitTypeDef QSPI_ComConfig_InitStructure = {0};
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_IMode       = QSPI_ComConfig_IMode_1Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADMode      = QSPI_ComConfig_ADMode_4Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DMode       = QSPI_ComConfig_DMode_4Line;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABMode      = QSPI_ComConfig_ABMode_NoAlternateByte;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_FMode       = QSPI_ComConfig_FMode_Indirect_Read;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_SIOOMode    = QSPI_ComConfig_SIOOMode_Disable;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ABSize      = QSPI_ComConfig_ABSize_8bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_ADSize      = QSPI_ComConfig_ADSize_24bit;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_Ins         = FLASH_CMD_FastReadQuadIO;
    QSPI_ComConfig_InitStructure.QSPI_ComConfig_DummyCycles = 6;
    QSPI_ComConfig_Init(QSPI1, &QSPI_ComConfig_InitStructure);

