ch32-riscv-ug/CH32V20x/EVT_205/EXAM/QSPI/QSPI_FLASH_DMA/User/main.c
    QSPI_SetAddress(QSPI1, addr);
    QSPI_SetDataLength(QSPI1, len);

    QSPI_EnableQuad(QSPI1, ENABLE);
    QSPI_Rx_DMA(data, len);
    QSPI_DMACmd(QSPI1, ENABLE);
    QSPI_Start(QSPI1);
    DMA_Cmd(DMA2_Channel1, ENABLE);

    while (DMA_GetFlagStatus(DMA2, DMA_FLAG_TC1) == RESET)
    {
    }

    while (QSPI_GetFlagStatus(QSPI1, QSPI_FLAG_TC) == RESET)
    {
    }
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_DMACmd(QSPI1, DISABLE);
    QSPI_EnableQuad(QSPI1, DISABLE);
}

/*********************************************************************
 * @fn      Buffer_Cmp
 * 
 * @brief   Compare two buffers
 * 
 * @param   buf1 - the first buffer
 *          buf2 - the second buffer
 *          len - the length of the buffers
 * 
 * @return  the index of the first different byte, or -1 if the buffers are identical
 */
int32_t Buffer_Cmp(uint8_t* buf1, uint8_t* buf2, uint32_t len)
{
    int32_t res = -1;
    for (int i = 0; i < len; i++)
    {
        if (buf1[i] != buf2[i])
        {
            res = i;
            break;
        }
    }
    return res;
}

/*********************************************************************
 * @fn      Print_Buffer
 * 
 * @brief   Print a buffer
 * 
 * @param   buf - the buffer to print
 *          len - the length of the buffer
 * 
 * @return  none
 */
void Print_Buffer(u8* buf, u32 len)
{
    for (uint32_t i = 0; i < len; i++)
    {
        printf("%02x ", buf[i]);
        if ((i + 1) % 16 == 0)
        {
            printf("\n");
        }
    }
    printf("\nEND\n");
}

/*********************************************************************
 * @fn      write_data
 * 
 * @brief   Write  data to the FLASH
 * 
 * @param   addr - The address to be written.It must be a 4K-aligned address
 *          data - the data to be Wrote
 *          len - The length of the written data.It must be a multiple of 256
 * 
 * @return  none
 */
void write_data(uint32_t addr, uint8_t* data, size_t len)
{
    uint32_t current_addr = addr;
    uint8_t* current_data = data;
    size_t   remaining    = len;

    while (remaining > 0)
    {
        if (current_addr % FLASH_SECTOR_SIZE == 0)
        {
            QSPI_EraseSector(current_addr);
        }

        QSPI_ProgramPageQuad(current_addr, current_data, FLASH_PAGE_SIZE);
        current_addr += FLASH_PAGE_SIZE;
        current_data += FLASH_PAGE_SIZE;
        remaining -= FLASH_PAGE_SIZE;
    }
}

/*********************************************************************
 * @fn      main
 * 
 * @brief   Main function
 * 
 * @return  none
 */
int main(void)
{

    SystemCoreClockUpdate();
    Delay_Init();
    USART_Printf_Init(115200);
    printf("SystemClk:%d\r\n", SystemCoreClock);
    printf("ChipID:%08x\r\n", DBGMCU_GetCHIPID());
    printf("QSPI TEST\n");

    GPIO_Config();
    QSPI1_Config();

    QSPI_Cmd(QSPI1, ENABLE);

    QSPI_WriteCmd(FLASH_CMD_EnableReset);
    QSPI_WriteCmd(FLASH_CMD_ResetDevice);
    Delay_Us(100);
    QSPI_WaitForBsy();

#if 0
    // Some chips do not have QUAD mode enabled by default.
    // Use the following command to enable QUAD mode
    QSPI_WriteEnable();
    QSPI_WriteCmd(0x50);
    QSPI_CmdWithData(0x31, 0x02);
#endif

    printf("GetManufacturerID %x\n", QSPI_GetManufacturerID());
    printf("GetManufacturerID_DualIO %x\n", QSPI_GetManufacturerID_DualIO());
    printf("GetManufacturerID_QuadIO %x\n", QSPI_GetManufacturerID_QuadIO());
    printf("sr1 %x\n", QSPI_ReadSR(FLASH_CMD_ReadStatus_REG1));
    printf("sr2 %x\n", QSPI_ReadSR(FLASH_CMD_ReadStatus_REG2));

    const uint32_t rd_addr = 0x50000;
    const uint32_t rd_len  = 256;
    int32_t        res     = 0;

    printf("one line read\n");
    QSPI_GetData(rd_addr, verifyBuffer, rd_len);
    Print_Buffer(verifyBuffer, rd_len);
    Delay_Ms(1);

    printf("DualIO read\n");
    memset(readBuffer, 0, rd_len);
    QSPI_GetData_DualIO(rd_addr, readBuffer, rd_len);

    res = Buffer_Cmp(verifyBuffer, readBuffer, rd_len);

    if (res != -1)
    {
        printf("DualIO read error %d\n", res);
        Print_Buffer(readBuffer, rd_len);
    }
    else
    {
        printf("DualIO read success\n");
    }

    printf("QuadIO read\n");
    memset(readBuffer, 0, rd_len);
    QSPI_GetData_QuadIO(rd_addr, readBuffer, rd_len);
    res = Buffer_Cmp(verifyBuffer, readBuffer, rd_len);

    if (res != -1)
    {
        printf("QuadIO read error %d\n", res);
        Print_Buffer(readBuffer, rd_len);
    }
    else
    {
        printf("QuadIO read success\n");
    }

    printf("read test and verify end\n");

    while (1)
    {
    }
}
